{
    "id": "6527114d1517d091d7452440",
    "address": null,
    "badges": {
        "fogbugz": "",
        "checkItems": 0,
        "checkItemsChecked": 0,
        "checkItemsEarliestDue": null,
        "comments": 0,
        "attachments": 1,
        "description": true,
        "due": null,
        "dueComplete": false,
        "start": null,
        "lastUpdatedByAi": false,
        "attachmentsByType": {
            "trello": {
                "board": 0,
                "card": 0
            }
        },
        "externalSource": null,
        "location": false,
        "votes": 0,
        "maliciousAttachments": 0,
        "viewingMemberVoted": false,
        "subscribed": false
    },
    "checkItemStates": [],
    "closed": false,
    "coordinates": null,
    "creationMethod": null,
    "creationMethodError": null,
    "creationMethodLoadingStartedAt": null,
    "dueComplete": false,
    "dateClosed": null,
    "dateLastActivity": "2023-12-05T16:15:46.008Z",
    "dateCompleted": null,
    "dateViewedByCreator": null,
    "desc": "The latest Title Update is now available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadium, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team",
    "descData": {
        "emoji": {}
    },
    "due": null,
    "dueReminder": null,
    "email": null,
    "externalSource": null,
    "idBoard": "5f73f7c1b4c1280a7068df5f",
    "idChecklists": [],
    "idLabels": [
        "64a6d93136e6c63d5556ac6f",
        "5f73f7c1b4c1280a7068dfeb"
    ],
    "idList": "65106b33b85885896f15d616",
    "idMemberCreator": null,
    "idMembers": [],
    "idMembersVoted": [],
    "idOrganization": "6137a564cb8f6432c89f8977",
    "idShort": 386,
    "idAttachmentCover": "65271272df566d1edca7ba7f",
    "labels": [
        {
            "id": "64a6d93136e6c63d5556ac6f",
            "idBoard": "5f73f7c1b4c1280a7068df5f",
            "idOrganization": "6137a564cb8f6432c89f8977",
            "name": "EA SPORTS FC 24",
            "nodeId": "ari:cloud:trello::label/workspace/6137a564cb8f6432c89f8977/64a6d93136e6c63d5556ac6f",
            "color": "green_dark",
            "uses": 87
        },
        {
            "id": "5f73f7c1b4c1280a7068dfeb",
            "idBoard": "5f73f7c1b4c1280a7068df5f",
            "idOrganization": "6137a564cb8f6432c89f8977",
            "name": "Title Update",
            "nodeId": "ari:cloud:trello::label/workspace/6137a564cb8f6432c89f8977/5f73f7c1b4c1280a7068dfeb",
            "color": "green",
            "uses": 182
        }
    ],
    "limits": {
        "attachments": {
            "perCard": {
                "status": "ok",
                "disableAt": 1000,
                "warnAt": 800
            }
        },
        "checklists": {
            "perCard": {
                "status": "ok",
                "disableAt": 500,
                "warnAt": 400
            }
        },
        "stickers": {
            "perCard": {
                "status": "ok",
                "disableAt": 70,
                "warnAt": 56
            }
        }
    },
    "locationName": null,
    "manualCoverAttachment": true,
    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
    "nodeId": "ari:cloud:trello::card/workspace/6137a564cb8f6432c89f8977/6527114d1517d091d7452440",
    "pinned": false,
    "pos": 81919,
    "shortLink": "hraWE6Bh",
    "shortUrl": "https://trello.com/c/hraWE6Bh",
    "singleInstrumentationId": null,
    "sourceEmail": null,
    "staticMapUrl": null,
    "start": null,
    "subscribed": null,
    "url": "https://trello.com/c/hraWE6Bh/386-ps5-ps4-xb1-xbsxs-pc-switch-title-update-3",
    "cover": {
        "idAttachment": "65271272df566d1edca7ba7f",
        "color": null,
        "idUploadedBackground": null,
        "size": "normal",
        "brightness": "dark",
        "scaled": [
            {
                "id": "65271273df566d1edca7babf",
                "_id": "65271273df566d1edca7babf",
                "scaled": false,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7babf/download/FC_24_TU_3.png",
                "bytes": 2675,
                "height": 50,
                "width": 70
            },
            {
                "id": "65271273df566d1edca7bac1",
                "_id": "65271273df566d1edca7bac1",
                "scaled": true,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac1/download/FC_24_TU_3.png",
                "bytes": 8505,
                "height": 46,
                "width": 150
            },
            {
                "id": "65271273df566d1edca7bac0",
                "_id": "65271273df566d1edca7bac0",
                "scaled": false,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac0/download/FC_24_TU_3.png",
                "bytes": 19660,
                "height": 150,
                "width": 250
            },
            {
                "id": "65271273df566d1edca7bac2",
                "_id": "65271273df566d1edca7bac2",
                "scaled": true,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac2/download/FC_24_TU_3.png",
                "bytes": 26419,
                "height": 91,
                "width": 299
            },
            {
                "id": "65271273df566d1edca7bac3",
                "_id": "65271273df566d1edca7bac3",
                "scaled": true,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac3/download/FC_24_TU_3.png",
                "bytes": 99901,
                "height": 183,
                "width": 600
            },
            {
                "id": "65271273df566d1edca7bac4",
                "_id": "65271273df566d1edca7bac4",
                "scaled": true,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac4/download/FC_24_TU_3.png",
                "bytes": 334197,
                "height": 329,
                "width": 1080
            },
            {
                "id": "65271273df566d1edca7bac5",
                "_id": "65271273df566d1edca7bac5",
                "scaled": true,
                "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/65271273df566d1edca7bac5/download/FC_24_TU_3.png",
                "bytes": 334040,
                "height": 329,
                "width": 1080
            }
        ],
        "idPlugin": null
    },
    "isTemplate": false,
    "cardRole": null,
    "mirrorSourceId": null,
    "mirrorSourceNodeId": null,
    "checklists": [],
    "customFieldItems": [],
    "members": [],
    "pluginData": [],
    "actions": [
        {
            "id": "656f4cb236ea12149028dfc0",
            "idMemberCreator": "5c48831d226ccb5009c3b830",
            "data": {
                "card": {
                    "pos": 81919,
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "pos": 8191.875
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "65106b33b85885896f15d616",
                    "name": "Game Updates Archive"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-12-05T16:15:46.044Z",
            "limits": null,
            "memberCreator": {
                "id": "5c48831d226ccb5009c3b830",
                "activityBlocked": false,
                "avatarHash": "65b8551dba3917ec1acddcfa24cd1bea",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5c48831d226ccb5009c3b830/65b8551dba3917ec1acddcfa24cd1bea",
                "fullName": "Paul Murphy",
                "idMemberReferrer": null,
                "initials": "PM",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "pmurphy_liveops"
            }
        },
        {
            "id": "656f4cb136ea12149028dc97",
            "idMemberCreator": "5c48831d226ccb5009c3b830",
            "data": {
                "card": {
                    "idList": "65106b33b85885896f15d616",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "idList": "5f73f7c1b4c1280a7068df61"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "listBefore": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                },
                "listAfter": {
                    "id": "65106b33b85885896f15d616",
                    "name": "Game Updates Archive"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-12-05T16:15:45.634Z",
            "limits": null,
            "memberCreator": {
                "id": "5c48831d226ccb5009c3b830",
                "activityBlocked": false,
                "avatarHash": "65b8551dba3917ec1acddcfa24cd1bea",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5c48831d226ccb5009c3b830/65b8551dba3917ec1acddcfa24cd1bea",
                "fullName": "Paul Murphy",
                "idMemberReferrer": null,
                "initials": "PM",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "pmurphy_liveops"
            }
        },
        {
            "id": "6527c3dce6b3fcbdbd7e8cdd",
            "idMemberCreator": "55fab97406891939fbe4cb5e",
            "data": {
                "card": {
                    "desc": "The latest Title Update is now available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadium, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "desc": "The latest Title Update is now available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-12T10:01:00.508Z",
            "limits": null,
            "memberCreator": {
                "id": "55fab97406891939fbe4cb5e",
                "activityBlocked": false,
                "avatarHash": "12acb16aff4d994e1b6cf238d7522e59",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/55fab97406891939fbe4cb5e/12acb16aff4d994e1b6cf238d7522e59",
                "fullName": "D-Maks",
                "idMemberReferrer": null,
                "initials": "D",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "denissmaksimovs"
            }
        },
        {
            "id": "6527ba584258b5c49a19778f",
            "idMemberCreator": "5c48831d226ccb5009c3b830",
            "data": {
                "card": {
                    "desc": "The latest Title Update is now available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-12T09:20:24.916Z",
            "limits": null,
            "memberCreator": {
                "id": "5c48831d226ccb5009c3b830",
                "activityBlocked": false,
                "avatarHash": "65b8551dba3917ec1acddcfa24cd1bea",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5c48831d226ccb5009c3b830/65b8551dba3917ec1acddcfa24cd1bea",
                "fullName": "Paul Murphy",
                "idMemberReferrer": null,
                "initials": "PM",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "pmurphy_liveops"
            }
        },
        {
            "id": "65271290c6841492e99b5e73",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "idLabels": [
                        "64a6d93136e6c63d5556ac6f",
                        "5f73f7c1b4c1280a7068dfeb"
                    ],
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "idLabels": [
                        "64a6d93136e6c63d5556ac6f"
                    ]
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:24:32.198Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "652712903829dae9d30adf37",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "idLabels": [
                        "64a6d93136e6c63d5556ac6f"
                    ],
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "idLabels": []
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:24:32.182Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "6527128131bdee19a262a700",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "pos": 8191.875,
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "pos": 82431.75
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:24:17.641Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "65271273df566d1edca7bad4",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "attachment": {
                    "id": "65271272df566d1edca7ba7f",
                    "name": "FC 24 TU 3.png",
                    "url": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/download/FC_24_TU_3.png",
                    "previewUrl": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/preview/download/FC_24_TU_3.png",
                    "previewUrl2x": "https://trello.com/1/cards/6527114d1517d091d7452440/attachments/65271272df566d1edca7ba7f/previews/preview2x/download/FC_24_TU_3.png"
                },
                "card": {
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                }
            },
            "appCreator": null,
            "type": "addAttachmentToCard",
            "date": "2023-10-11T21:24:03.634Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "652712614cd3b09ad0c0ac91",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n- The EA SPORTS FC Team",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n‌\n\n- The EA SPORTS FC Team"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:23:45.249Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "6527120929f82a9bad548011",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future.\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only.\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n- SBC Group descriptions were not always visible.\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List.\n- Some Stadium Items in the Store were not previewing when selected for the first time.\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n- When attempting to exit out of a category in the Store, the entire Store was closed instead.\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches.\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens.\n- Some UI elements had font color and background combinations that were difficult to read.\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n- [PC Only] The Store could not have been entered when using certain resolutions.\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n- Slightly increased Jockey turning speed when moving at slower speeds.\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions.\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes.\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n- Trapping refers to a player attempting to control the ball when receiving it.\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n- This issue was more common when receiving Precision Passes.\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit.\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player.\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n- A contextual volley could have incorrectly occurred in some heading situations.\n- A requested Header On Demand could have sometimes resulted in a tackle instead.\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n- Some players did not see a Fitness decrease following Playable Highlights matches.\n- During a corner kick, an incorrect idle animation could have played before the kick was taken.\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n- In some situations, slide tackle animations did not play correctly.\n- An unintended animation could occur during a Stop And Face Goal request.\n- Players could sometimes pass through ad boards instead of jumping over them.\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n- A tired player’s running animation could have occurred incorrectly sometimes.\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n- Improved several player emoting animations.\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change.\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n- CPU AI players could have performed possession-losing knock ons too often.\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle.\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs\n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting.\n- Following the completion of a match, the Match Player Summary did not always display correct information.\n- Addressed instances of a stability issue that could have occurred after completing a match.\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n- Virtual Pros without a Club could have worn an unintended kit in menus.\n\n### Career Mode\n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career.\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA\n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n- A full sized net was incorrectly present in some VOLTA Arcade games.\n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues:\n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n- Some pre and post-match scenes could have displayed visual issues.\n- A stability issue could have occurred when changing Commentary Languages and Teams.\n- Addressed instances of placeholder text.\n- Addressed instances of disappearing and hard to read UI elements.\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n- During first person referee scenes, players could have passed through ad boards at times.\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n- The Directed Run visual indicator did not display in the Practice Arena.\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected.\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons.\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings.\n- The Online Seasons Leaderboard did not always display data on all friends.\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@‌EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n‌\n\n- The EA SPORTS FC Team",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future. \n\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only. \n\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n\n- SBC Group descriptions were not always visible.\n\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List. \n\n- Some Stadium Items in the Store were not previewing when selected for the first time. \n\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n\n- When attempting to exit out of a category in the Store, the entire Store was closed instead. \n\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches. \n\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens. \n\n- Some UI elements had font color and background combinations that were difficult to read.\n\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n\n- [PC Only] The Store could not have been entered when using certain resolutions.\n\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n\n- Slightly increased Jockey turning speed when moving at slower speeds.\n\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions. \n\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes. \n\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n\n- Trapping refers to a player attempting to control the ball when receiving it.\n\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n\n- This issue was more common when receiving Precision Passes.\n\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit. \n\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player. \n\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n\n- A contextual volley could have incorrectly occurred in some heading situations.\n\n- A requested Header On Demand could have sometimes resulted in a tackle instead. \n\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n\n- Some players did not see a Fitness decrease following Playable Highlights matches. \n\n- During a corner kick, an incorrect idle animation could have played before the kick was taken. \n\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n\n- In some situations, slide tackle animations did not play correctly. \n\n- An unintended animation could occur during a Stop And Face Goal request. \n\n- Players could sometimes pass through ad boards instead of jumping over them.\n\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver. \n\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n\n- A tired player’s running animation could have occurred incorrectly sometimes.\n\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n\n- Improved several player emoting animations.\n\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change. \n\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n\n- CPU AI players could have performed possession-losing knock ons too often.\n\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle. \n\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs \n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting. \n\n- Following the completion of a match, the Match Player Summary did not always display correct information. \n\n- Addressed instances of a stability issue that could have occurred after completing a match. \n\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n\n- Virtual Pros without a Club could have worn an unintended kit in menus. \n\n### Career Mode \n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career. \n\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA \n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n\n- A full sized net was incorrectly present in some VOLTA Arcade games. \n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues: \n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n\n- Some pre and post-match scenes could have displayed visual issues.\n\n- A stability issue could have occurred when changing Commentary Languages and Teams. \n\n- Addressed instances of placeholder text.\n\n- Addressed instances of disappearing and hard to read UI elements.\n\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n\n- During first person referee scenes, players could have passed through ad boards at times.\n\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n\n- The Directed Run visual indicator did not display in the Practice Arena. \n\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected. \n\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons. \n\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings. \n\n- The Online Seasons Leaderboard did not always display data on all friends. \n\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n‌\n\n- The EA SPORTS FC Team"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:22:17.269Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "6527120258c6c6fe864418bf",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "desc": "The latest Title Update will soon be available for all versions of EA SPORTS FC 24 and includes the changes below.\n\n### Ultimate Team\n\nAddressed the following issues:\n\n- On rare occasions, players could have disappeared from matches after a substitution or red card.\n\n- Following the completion of a match, sometimes the Advance menu option did not function unless another menu was first visited on the post-match screen.\n\n- Addressed the Ada Hegerberg Player Item causing gameplay impacting issues, the Item will become available for match use following a Server Release in the near future. \n\n- After watching End Highlights in a match, consecutive Squad Battles matches could not have been paused.\n\n- Addressed a stability issue that could have occurred when interacting with the Transfer Market.\n\n- Sometimes, when using Squad Builder, Player Items could have been placed in incorrect positions.\n\n- Stadium Item Pack openings in Ultimate Team were resulting in an unintended animation with placeholder text\n\n- The Squad Battles pre-match screen displayed a duration of 6 minutes instead of the intended 4 minutes per half, this was a visual issue only. \n\n- The Rivals Weekly Rewards timer and the Season Ends timer were reversed, this was a visual issue only.\n\n- SBC Group descriptions were not always visible.\n\n- In rare situations, UT Friendlies classic matches could have started with six players on the pitch, instead of the intended twenty-two.\n\n- When Comparing Price on Transfer Listed Player Items, Transfer List pages could not have been scrolled through until exiting and re-entering the Transfer List. \n\n- Some Stadium Items in the Store were not previewing when selected for the first time. \n\n- PlayStyles+ did not feature the plus symbol when viewed on a Player Bio screen.\n\n- On rare occasions, the Stadium Goal Pyrotechnics could have appeared in the center of the pitch.\n\n- When attempting to exit out of a category in the Store, the entire Store was closed instead. \n\n- The timer was not always displayed on the Kit Select screen for Rivals and Champions matches. \n\n- After exiting a Concept Player search from the Squad screen, the title did not always return to the correct screen.\n\n- The Shortcuts menu could have performed slower than intended on Leaderboards screens. \n\n- Some UI elements had font color and background combinations that were difficult to read.\n\n- In some specific cases, menu Shortcuts did not send players to the intended location.\n\n- In a rare scenario, menu Shortcuts could have interfered with Preview Pack animations.\n\n- Some Stadium Item rewards were not visible in Seasonal Objective rewards.\n\n- When selecting a Manager Item on the Squad screen and entering the Club tab, the search results did not always display Manager Items.\n\n- [PS5/XBSX|S/PC Only] A double walkout scene could have triggered two different songs playing simultaneously.\n\n- [PS5/XBSX|S/PC Only] Addressed a stability issue that could have occurred when attempting to play two versus one Co-Op Classic Matches.\n\n- [PC Only] The Store could not have been entered when using certain resolutions.\n\n- [Switch Only] A stability issue could have occurred when starting a Play a Friend match.\n\n### Gameplay\n\nMade the following changes:\n\n- Increased ball travel distance on manually requested Clearances.\n\n- Slightly increased Jockey turning speed when moving at slower speeds.\n\n- Slightly reduced the ball travel speed on Ground and Driven Passes performed by players with the Pinged Pass and Pinged Pass+ PlayStyles.\n\n- Increased the likelihood of a player with the Long Throw and Long Throw+ PlayStyles to be selected for a throw-in in advanced areas of the pitch.\n\n- Precision Finesse Shots can now consider an aiming input change that occurs right before the ball is hit.\n\n- Improved visuals for the ball carrier in situations where a red card foul has been committed during a breakaway.\n\nAddressed the following issues:\n\n- Sometimes, the goalkeeper could have run past their intended location when rushing out of goal\n\n- Players without the Intercept and Intercept+ PlayStyles could have performed contextual sliding interceptions. \n\n- The Pinged Pass and Pinged Pass+ PlayStyles were unintentionally impacting first-time passes. \n\n- Sometimes, players could have made inauthentic movements when attempting to trap the ball.\n\n- Trapping refers to a player attempting to control the ball when receiving it.\n\n- On some occasions, a player could have slowed their run for a moment when attempting to trap the ball from a pass.\n\n- This issue was more common when receiving Precision Passes.\n\n- The Drag Back Turn Skill Move did not follow the input angle as much as intended upon exit. \n\n- Reduced the likelihood of the Rainbow Flick Skill Move causing the ball to hit the back of the player. \n\n- Sometimes, a player could have taken a touch of the ball instead of attempting to perform a requested first time Chip Shot.\n\n- In some specific scenarios, a requested Finesse Shot could result in an unintended shooting animation.\n\n- In some air ball situations, Auto Switching did not follow the player’s Auto Switching Controls Settings.\n\n- A contextual volley could have incorrectly occurred in some heading situations.\n\n- A requested Header On Demand could have sometimes resulted in a tackle instead. \n\n- When the attacker dribbled straight at the defender, the defender could sometimes tackle the ball into the dribbler’s path.\n\n- Some players did not see a Fitness decrease following Playable Highlights matches. \n\n- During a corner kick, an incorrect idle animation could have played before the kick was taken. \n\n- Improved referee logic when determining foul calls in situations where the ball carrier is shielding the ball.\n\n- Improved referee logic when determining offside calls in situations where defenders miss an interception.\n\n- Improved referee logic when determining foul calls in situations where players are jostling for the ball while it’s in the air.\n\n- In some cases, players who went over the ad boards could have passed through non playable characters while returning to the pitch.\n\n- In some situations, slide tackle animations did not play correctly. \n\n- An unintended animation could occur during a Stop And Face Goal request. \n\n- Players could sometimes pass through ad boards instead of jumping over them.\n\n- Sometimes a shot could have resulted in the ball passing through a defender’s foot, during a tackle.\n\n- In rare cases, adjusting player positions in Team Management during a match could have resulted in players disappearing from the match.\n\n- Following a contextual sliding pass, sometimes the controlled player would not automatically switch to the intended pass receiver. \n\n- Following a slide tackle that results in the ball being passed to a teammate, sometimes the controlled player would not automatically switch to the intended pass receiver.\n\n- Agile Dribbling right before a pass animation was completed could have resulted in the controlled player not automatically switching to the intended pass receiver.\n\n- When moving to their position for set play, a player’s running animation could have occurred incorrectly.\n\n- A tired player’s running animation could have occurred incorrectly sometimes.\n\n- In some cases, a player’s feet could have looked like they were not making contact with the ground.\n\n- Following a save animation, goalkeepers could have unnaturally transitioned to another animation.\n\n- In some cases, goalkeepers did not celebrate passionately in some scenes after making a significant save\n\n- Improved several player emoting animations.\n\n- When jogging, sometimes the ball carrier could put their foot through the ball when turning.\n\n- When winning the ball from a tackle, sometimes the player did not follow a quick directional input change. \n\n- Reduced how often CPU AI goalkeepers can do a fake throw.\n\n- CPU AI players could have performed possession-losing knock ons too often.\n\n- Sometimes, goalkeepers could have abruptly dropped the ball following the final whistle. \n\n- In some rare cases, goalkeepers could have unnaturally transitioned to a save animation.\n\n- [Switch Only] Goalkeepers were unable to save top corner penalty kicks.\n\n- [Switch Only] Sometimes, the ball could have gone through the goal net.\n\n### Clubs \n\nAddressed the following issues:\n\n- Addressed instances of connection being lost when opponents were found in Drop-In matches, resulting in the affected matches not starting. \n\n- Following the completion of a match, the Match Player Summary did not always display correct information. \n\n- Addressed instances of a stability issue that could have occurred after completing a match. \n\n- The Club Leaderboard did not always display information if the player accessing it was not part of a Club.\n\n- Skill Games were incorrectly using base Attributes of Virtual Pros.\n\n- Virtual Pros without a Club could have worn an unintended kit in menus. \n\n### Career Mode \n\nAddressed the following issues:\n\n- After signing a new player in Manager Career, the Best Possible Deal could have displayed an incorrect value.\n\n- Custom Tactics could have reset to default when adjusting them outside of matches in Manager Career.\n\n- Youth Academy goalkeepers did not have any PlayStyles in Manager Career. \n\n- A stability issue could have occurred when attempting to fire a coach in Manager Career.\n\n- In Manager Career, the Wishlist apply button callout did not function as intended.\n\n- Some activities were incorrectly displayed during the Calendar tutorial in Manager Career.\n\n- In Player Career, the Retirement Gift Activity could have incorrectly occurred multiple times for one player.\n\n- In Player Career, the Scout Bonus did not apply to some Objectives.\n\n- The camera did not follow the player correctly in the Player Career Set Pieces Training Drill.\n\n### VOLTA \n\nAddressed the following issues:\n\n- The Team Keepaway Arcade game did not always end when the timer ran out.\n\n- A full sized net was incorrectly present in some VOLTA Arcade games. \n\n### General, Audio, and Visual\n\nMade the following changes:\n\n- Updated 162 star heads which will appear in-game following an upcoming Server Release.\n\n- Updated some stadia, sound effects, presentation packages, crowd noises, button callouts, boots, UI elements, and fonts.\n\nAddressed the following issues: \n\n- Sometimes, the PlayStyle+ indicator did not display incorrectly.\n\n- Some pre and post-match scenes could have displayed visual issues.\n\n- A stability issue could have occurred when changing Commentary Languages and Teams. \n\n- Addressed instances of placeholder text.\n\n- Addressed instances of disappearing and hard to read UI elements.\n\n- After 120 minutes played, bench players could sometimes be seated in incorrect positions.\n\n- During first person referee scenes, players could have passed through ad boards at times.\n\n- In some cases, the ball did not deform correctly when bouncing, this was a visual issue only.\n\n- The Defending Trainer was incorrectly enabled for all Training Center chapters instead of only for the Defending one.\n\n- The Directed Run visual indicator did not display in the Practice Arena. \n\n- At the start of the Directed Runs Skill Game, Directed Runs did not function as expected. \n\n- In a rare scenario, a match could have occurred against a CPU opponent in Online Seasons. \n\n- Sometimes, a player’s hair color could change depending on weather and time of day.\n\n- The Training Center Practice Arena did not follow the Alternate control scheme when set in Controller Settings. \n\n- The Online Seasons Leaderboard did not always display data on all friends. \n\n- [PS5, German Players Only] Removed the Virtual Bundesliga competition from the main menu with the intent of it returning closer to the competition’s start.\n\n- [Switch Only] After downloading and selecting a specific commentary language, one of the other available languages could have occurred instead.\n\n- [Switch Only] Local Seasons stats could have incorrectly reset.\n\n- [PS4 Only] After completing an Online Seasons or Co-Op Seasons match, selecting the Next Match option could have resulted in a stability issue.\n\n- [PS4/XB1 Only] A rare stability issue could have occurred in the Online Seasons menu.\n\n- [PC Only] In Tournament matches, pausing the match did not always function if the EA app overlay was previously opened.\n\nThanks to those who’ve provided feedback. Throughout the course of the EA SPORTS FC 24 season, we'll provide you with more information and updates if and when they become available. Be sure to follow \\@EASFCDIRECT on Twitter and to check out the EA SPORTS FC Tracker for the latest news and updates.\n\n‌\n\n- The EA SPORTS FC Team",
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "old": {
                    "desc": ""
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                }
            },
            "appCreator": null,
            "type": "updateCard",
            "date": "2023-10-11T21:22:10.139Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        },
        {
            "id": "6527114d1517d091d7452449",
            "idMemberCreator": "5d5b1beea30eaf1b648e6ee7",
            "data": {
                "card": {
                    "id": "6527114d1517d091d7452440",
                    "name": "[PS5/PS4/XB1/XBSX|S/PC/SWITCH] Title Update #3",
                    "idShort": 386,
                    "shortLink": "hraWE6Bh"
                },
                "list": {
                    "id": "5f73f7c1b4c1280a7068df61",
                    "name": "Latest News"
                },
                "board": {
                    "id": "5f73f7c1b4c1280a7068df5f",
                    "name": "EA SPORTS FC Tracker",
                    "shortLink": "keigLn6R"
                }
            },
            "appCreator": null,
            "type": "createCard",
            "date": "2023-10-11T21:19:09.624Z",
            "limits": null,
            "memberCreator": {
                "id": "5d5b1beea30eaf1b648e6ee7",
                "activityBlocked": false,
                "avatarHash": "9b8c2ae64bd8604e7257419fe56df466",
                "avatarUrl": "https://trello-members.s3.amazonaws.com/5d5b1beea30eaf1b648e6ee7/9b8c2ae64bd8604e7257419fe56df466",
                "fullName": "Goran",
                "idMemberReferrer": null,
                "initials": "G",
                "nonPublic": {},
                "nonPublicAvailable": true,
                "username": "goran_drpoplove"
            }
        }
    ]
}